# Birthday-problem


## 내용

 Birthday problem이라 하는 것은 무작위 n명이 속한 집단의 경우,
그 집단 안에서 생일이 같은 경우가 있을 확률을 계산하는 것을 말한다.
 실제로 1년이 365일(윤년 366일)이므로 365+1 명(윤년 366+1명)이 존재한다면 100%의 확률로 생일이 같은 사람이 집단 안에 존재한다.

## 설명

방금 전 예시를 통해 전체 일 수보다 많은 인원이 존재한다면 생일이 같은 인원이 있을 확률은 100%이다. 
하지만, 인원의 수가 점차 줄어든다면 확률은 달라지게된다.
 
 단순히 생각을 한다면, 366명인 경우 100%의 확률을 가지므로 366명의 절반인 183명이라면 50% 정도의 확률을 가질 것으로 생각하곤 한다.
 하지만 이러한 생각과는 달리 계산을 통해 본다면 50%의 확률을 가지는 것은 23명 부터다. 또한 60명부터는 99.X%의 확률을 가진다. 이러한 결과의 이유는 계산을 보면 알 수 있다.

이를 계산하는 것이 Birthday-problem으로 아래에 정리되어 있다.

## 계산

이 계산의 공식은 
(생일이 같을 확률) = (전체 확률) - (생일이 모두 다른 확률)으로 각 요소를 계산 후 시행한다.

- (전체 확률)
: 한 사건에서 전체가 가지는 확률은 1이다. 
그러므로 여기서도 (전체 확률) = 1 이다.

- (생일이 모두 다른 확률)
: 우선 n명까지의 생일을  성정하고 각각의 확률을 곱해야 한다.

 전체 365일이라 가정할 때(윤년은 366일로 계산), n명의 인원의 생일을 나열한다면
1번째 인원: 365 / 365 (전체 일)
2번째 인원: 364 / 365 (전체 일- 1번째 인원 생일) 
3번째 인원: 363 / 365 (전체 일- 1~2번째 인원 생일) 
4번째 인원: 362 / 365 (전체 일- 1~3번째 인원 생일) 
5번째 인원: 361 / 365 (전체 일- 1~4번째 인원 생일) 
6번째 인원: 360 / 365 (전체 일- 1~5번째 인원 생일) 
.
.
.
n번째 인원: 365-(n-1) / 365 (전체 일- 1~(n-1)번째 인원 생일)

-> (365 / 365) X (364 / 365) X (363 / 365) X (362 / 365) X ... X (365-(n-1) / 365)

-> (1 / 365)의 n 제곱 X (365 X 364 X 363 X 362 X (365-(n-1)) )

최종적으로 
(생일이 같을 확률) = (전체 확률) - (생일이 모두 다른 확률)
    = 1 - {(1 / 365)의 n 제곱 X (365 X 364 X 363 X 362 X ... X (365-(n-1)) )} 이다. 

예) n = 15명 일 때,

(생일이 같을 확률) = 1 - {(1/365)의 15제곱X (365 X 364 X 363 X 362 X ... X 351) }
                   = 1 - {(3.67.. X 10의 -39제곱) X (2.03.. X 10의 38제곱)}
                   = 1 - 0.747.. = 0.252... = 약 25.2%

다른 방법으로는 순열을 이용한 계산방법 등이 있다.
